version 1.0;
graph mobilenet_v1_1( input ) -> ( output )
{
	input = external<scalar>(shape = [1,3,224,224]);
	mobilenetv1_conv2d_0_weights = variable<scalar>(shape = [32,3,3,3], label = 'MobilenetV1/Conv2d_0/weights');
	mobilenetv1_mobilenetv1_conv2d_0_conv2d = conv(input, mobilenetv1_conv2d_0_weights, 0.0, border = 'constant', padding = [], stride = [2,2], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_0_batchnorm_gamma = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_0/BatchNorm/gamma');
	mobilenetv1_conv2d_0_batchnorm_beta = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_0/BatchNorm/beta');
	mobilenetv1_conv2d_0_batchnorm_moving_mean = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_0/BatchNorm/moving_mean');
	mobilenetv1_conv2d_0_batchnorm_moving_variance = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_0/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_0_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_0_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_0_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_0_conv2d, mobilenetv1_conv2d_0_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_0_conv2d = div(mobilenetv1_mobilenetv1_conv2d_0_conv2d, mobilenetv1_conv2d_0_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_0_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_0_conv2d, mobilenetv1_conv2d_0_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_0_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_0_conv2d, mobilenetv1_conv2d_0_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_0_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_0_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_0_relu6 = min(mobilenetv1_mobilenetv1_conv2d_0_relu6_relu, 6.0);
	mobilenetv1_conv2d_1_depthwise_depthwise_weights = variable<scalar>(shape = [32,1,3,3], label = 'MobilenetV1/Conv2d_1_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_0_relu6, mobilenetv1_conv2d_1_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 32);
	mobilenetv1_conv2d_1_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_1_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_1_depthwise_batchnorm_beta = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_1_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_1_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_1_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_1_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,32], label = 'MobilenetV1/Conv2d_1_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_1_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_1_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise, mobilenetv1_conv2d_1_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise, mobilenetv1_conv2d_1_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise, mobilenetv1_conv2d_1_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_1_depthwise_depthwise, mobilenetv1_conv2d_1_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_1_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_1_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_1_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_1_pointwise_weights = variable<scalar>(shape = [64,32,1,1], label = 'MobilenetV1/Conv2d_1_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_1_depthwise_relu6, mobilenetv1_conv2d_1_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_1_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_1_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_1_pointwise_batchnorm_beta = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_1_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_1_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_1_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_1_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_1_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_1_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_1_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d, mobilenetv1_conv2d_1_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d, mobilenetv1_conv2d_1_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d, mobilenetv1_conv2d_1_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_1_pointwise_conv2d, mobilenetv1_conv2d_1_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_1_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_1_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_1_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_2_depthwise_depthwise_weights = variable<scalar>(shape = [64,1,3,3], label = 'MobilenetV1/Conv2d_2_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_1_pointwise_relu6, mobilenetv1_conv2d_2_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [2,2], dilation = [1,1], groups = 64);
	mobilenetv1_conv2d_2_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_2_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_2_depthwise_batchnorm_beta = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_2_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_2_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_2_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_2_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,64], label = 'MobilenetV1/Conv2d_2_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_2_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_2_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise, mobilenetv1_conv2d_2_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise, mobilenetv1_conv2d_2_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise, mobilenetv1_conv2d_2_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_2_depthwise_depthwise, mobilenetv1_conv2d_2_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_2_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_2_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_2_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_2_pointwise_weights = variable<scalar>(shape = [128,64,1,1], label = 'MobilenetV1/Conv2d_2_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_2_depthwise_relu6, mobilenetv1_conv2d_2_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_2_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_2_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_2_pointwise_batchnorm_beta = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_2_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_2_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_2_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_2_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_2_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_2_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_2_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d, mobilenetv1_conv2d_2_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d, mobilenetv1_conv2d_2_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d, mobilenetv1_conv2d_2_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_2_pointwise_conv2d, mobilenetv1_conv2d_2_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_2_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_2_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_2_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_3_depthwise_depthwise_weights = variable<scalar>(shape = [128,1,3,3], label = 'MobilenetV1/Conv2d_3_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_2_pointwise_relu6, mobilenetv1_conv2d_3_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 128);
	mobilenetv1_conv2d_3_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_3_depthwise_batchnorm_beta = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_3_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_3_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_3_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_3_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise, mobilenetv1_conv2d_3_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise, mobilenetv1_conv2d_3_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise, mobilenetv1_conv2d_3_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_3_depthwise_depthwise, mobilenetv1_conv2d_3_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_3_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_3_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_3_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_3_pointwise_weights = variable<scalar>(shape = [128,128,1,1], label = 'MobilenetV1/Conv2d_3_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_3_depthwise_relu6, mobilenetv1_conv2d_3_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_3_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_3_pointwise_batchnorm_beta = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_3_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_3_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_3_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_3_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_3_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d, mobilenetv1_conv2d_3_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d, mobilenetv1_conv2d_3_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d, mobilenetv1_conv2d_3_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_3_pointwise_conv2d, mobilenetv1_conv2d_3_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_3_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_3_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_3_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_4_depthwise_depthwise_weights = variable<scalar>(shape = [128,1,3,3], label = 'MobilenetV1/Conv2d_4_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_3_pointwise_relu6, mobilenetv1_conv2d_4_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [2,2], dilation = [1,1], groups = 128);
	mobilenetv1_conv2d_4_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_4_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_4_depthwise_batchnorm_beta = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_4_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_4_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_4_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_4_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,128], label = 'MobilenetV1/Conv2d_4_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_4_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_4_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise, mobilenetv1_conv2d_4_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise, mobilenetv1_conv2d_4_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise, mobilenetv1_conv2d_4_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_4_depthwise_depthwise, mobilenetv1_conv2d_4_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_4_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_4_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_4_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_4_pointwise_weights = variable<scalar>(shape = [256,128,1,1], label = 'MobilenetV1/Conv2d_4_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_4_depthwise_relu6, mobilenetv1_conv2d_4_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_4_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_4_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_4_pointwise_batchnorm_beta = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_4_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_4_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_4_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_4_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_4_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_4_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_4_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d, mobilenetv1_conv2d_4_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d, mobilenetv1_conv2d_4_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d, mobilenetv1_conv2d_4_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_4_pointwise_conv2d, mobilenetv1_conv2d_4_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_4_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_4_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_4_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_5_depthwise_depthwise_weights = variable<scalar>(shape = [256,1,3,3], label = 'MobilenetV1/Conv2d_5_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_4_pointwise_relu6, mobilenetv1_conv2d_5_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 256);
	mobilenetv1_conv2d_5_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_5_depthwise_batchnorm_beta = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_5_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_5_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_5_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_5_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise, mobilenetv1_conv2d_5_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise, mobilenetv1_conv2d_5_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise, mobilenetv1_conv2d_5_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_5_depthwise_depthwise, mobilenetv1_conv2d_5_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_5_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_5_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_5_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_5_pointwise_weights = variable<scalar>(shape = [256,256,1,1], label = 'MobilenetV1/Conv2d_5_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_5_depthwise_relu6, mobilenetv1_conv2d_5_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_5_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_5_pointwise_batchnorm_beta = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_5_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_5_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_5_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_5_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_5_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d, mobilenetv1_conv2d_5_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d, mobilenetv1_conv2d_5_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d, mobilenetv1_conv2d_5_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_5_pointwise_conv2d, mobilenetv1_conv2d_5_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_5_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_5_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_5_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_6_depthwise_depthwise_weights = variable<scalar>(shape = [256,1,3,3], label = 'MobilenetV1/Conv2d_6_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_5_pointwise_relu6, mobilenetv1_conv2d_6_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [2,2], dilation = [1,1], groups = 256);
	mobilenetv1_conv2d_6_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_6_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_6_depthwise_batchnorm_beta = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_6_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_6_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_6_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_6_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,256], label = 'MobilenetV1/Conv2d_6_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_6_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_6_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise, mobilenetv1_conv2d_6_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise, mobilenetv1_conv2d_6_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise, mobilenetv1_conv2d_6_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_6_depthwise_depthwise, mobilenetv1_conv2d_6_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_6_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_6_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_6_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_6_pointwise_weights = variable<scalar>(shape = [512,256,1,1], label = 'MobilenetV1/Conv2d_6_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_6_depthwise_relu6, mobilenetv1_conv2d_6_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_6_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_6_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_6_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_6_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_6_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_6_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_6_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_6_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_6_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_6_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d, mobilenetv1_conv2d_6_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d, mobilenetv1_conv2d_6_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d, mobilenetv1_conv2d_6_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_6_pointwise_conv2d, mobilenetv1_conv2d_6_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_6_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_6_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_6_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_7_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_7_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_6_pointwise_relu6, mobilenetv1_conv2d_7_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_7_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_7_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_7_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_7_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_7_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_7_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise, mobilenetv1_conv2d_7_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise, mobilenetv1_conv2d_7_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise, mobilenetv1_conv2d_7_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_7_depthwise_depthwise, mobilenetv1_conv2d_7_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_7_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_7_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_7_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_7_pointwise_weights = variable<scalar>(shape = [512,512,1,1], label = 'MobilenetV1/Conv2d_7_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_7_depthwise_relu6, mobilenetv1_conv2d_7_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_7_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_7_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_7_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_7_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_7_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_7_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_7_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d, mobilenetv1_conv2d_7_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d, mobilenetv1_conv2d_7_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d, mobilenetv1_conv2d_7_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_7_pointwise_conv2d, mobilenetv1_conv2d_7_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_7_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_7_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_7_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_8_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_8_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_7_pointwise_relu6, mobilenetv1_conv2d_8_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_8_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_8_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_8_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_8_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_8_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_8_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise, mobilenetv1_conv2d_8_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise, mobilenetv1_conv2d_8_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise, mobilenetv1_conv2d_8_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_8_depthwise_depthwise, mobilenetv1_conv2d_8_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_8_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_8_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_8_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_8_pointwise_weights = variable<scalar>(shape = [512,512,1,1], label = 'MobilenetV1/Conv2d_8_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_8_depthwise_relu6, mobilenetv1_conv2d_8_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_8_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_8_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_8_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_8_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_8_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_8_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_8_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d, mobilenetv1_conv2d_8_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d, mobilenetv1_conv2d_8_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d, mobilenetv1_conv2d_8_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_8_pointwise_conv2d, mobilenetv1_conv2d_8_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_8_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_8_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_8_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_9_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_9_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_8_pointwise_relu6, mobilenetv1_conv2d_9_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_9_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_9_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_9_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_9_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_9_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_9_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise, mobilenetv1_conv2d_9_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise, mobilenetv1_conv2d_9_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise, mobilenetv1_conv2d_9_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_9_depthwise_depthwise, mobilenetv1_conv2d_9_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_9_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_9_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_9_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_9_pointwise_weights = variable<scalar>(shape = [512,512,1,1], label = 'MobilenetV1/Conv2d_9_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_9_depthwise_relu6, mobilenetv1_conv2d_9_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_9_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_9_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_9_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_9_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_9_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_9_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_9_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d, mobilenetv1_conv2d_9_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d, mobilenetv1_conv2d_9_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d, mobilenetv1_conv2d_9_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_9_pointwise_conv2d, mobilenetv1_conv2d_9_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_9_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_9_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_9_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_10_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_10_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_9_pointwise_relu6, mobilenetv1_conv2d_10_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_10_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_10_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_10_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_10_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_10_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_10_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise, mobilenetv1_conv2d_10_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise, mobilenetv1_conv2d_10_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise, mobilenetv1_conv2d_10_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_10_depthwise_depthwise, mobilenetv1_conv2d_10_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_10_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_10_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_10_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_10_pointwise_weights = variable<scalar>(shape = [512,512,1,1], label = 'MobilenetV1/Conv2d_10_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_10_depthwise_relu6, mobilenetv1_conv2d_10_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_10_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_10_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_10_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_10_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_10_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_10_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_10_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d, mobilenetv1_conv2d_10_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d, mobilenetv1_conv2d_10_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d, mobilenetv1_conv2d_10_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_10_pointwise_conv2d, mobilenetv1_conv2d_10_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_10_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_10_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_10_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_11_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_11_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_10_pointwise_relu6, mobilenetv1_conv2d_11_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_11_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_11_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_11_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_11_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_11_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_11_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise, mobilenetv1_conv2d_11_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise, mobilenetv1_conv2d_11_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise, mobilenetv1_conv2d_11_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_11_depthwise_depthwise, mobilenetv1_conv2d_11_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_11_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_11_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_11_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_11_pointwise_weights = variable<scalar>(shape = [512,512,1,1], label = 'MobilenetV1/Conv2d_11_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_11_depthwise_relu6, mobilenetv1_conv2d_11_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_11_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_11_pointwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_pointwise/BatchNorm/beta');
	mobilenetv1_conv2d_11_pointwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_pointwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_11_pointwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_11_pointwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_11_pointwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_11_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d = sub(mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d, mobilenetv1_conv2d_11_pointwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d = div(mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d, mobilenetv1_conv2d_11_pointwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d = mul(mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d, mobilenetv1_conv2d_11_pointwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_11_pointwise_conv2d, mobilenetv1_conv2d_11_pointwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_11_pointwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_11_pointwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_11_pointwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_12_depthwise_depthwise_weights = variable<scalar>(shape = [512,1,3,3], label = 'MobilenetV1/Conv2d_12_depthwise/depthwise_weights');
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise = conv(mobilenetv1_mobilenetv1_conv2d_11_pointwise_relu6, mobilenetv1_conv2d_12_depthwise_depthwise_weights, 0.0, border = 'constant', padding = [], stride = [2,2], dilation = [1,1], groups = 512);
	mobilenetv1_conv2d_12_depthwise_batchnorm_gamma = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_12_depthwise/BatchNorm/gamma');
	mobilenetv1_conv2d_12_depthwise_batchnorm_beta = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_12_depthwise/BatchNorm/beta');
	mobilenetv1_conv2d_12_depthwise_batchnorm_moving_mean = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_12_depthwise/BatchNorm/moving_mean');
	mobilenetv1_conv2d_12_depthwise_batchnorm_moving_variance = variable<scalar>(shape = [1,512], label = 'MobilenetV1/Conv2d_12_depthwise/BatchNorm/moving_variance');
	#batch_normalization...ok
	mobilenetv1_conv2d_12_depthwise_batchnorm_moving_variance = sqrt(mobilenetv1_conv2d_12_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise = sub(mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise, mobilenetv1_conv2d_12_depthwise_batchnorm_moving_mean);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise = div(mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise, mobilenetv1_conv2d_12_depthwise_batchnorm_moving_variance);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise = mul(mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise, mobilenetv1_conv2d_12_depthwise_batchnorm_gamma);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_batchnorm_fusedbatchnorm = add(mobilenetv1_mobilenetv1_conv2d_12_depthwise_depthwise, mobilenetv1_conv2d_12_depthwise_batchnorm_beta);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_relu6_relu = relu(mobilenetv1_mobilenetv1_conv2d_12_depthwise_batchnorm_fusedbatchnorm);
	mobilenetv1_mobilenetv1_conv2d_12_depthwise_relu6 = min(mobilenetv1_mobilenetv1_conv2d_12_depthwise_relu6_relu, 6.0);
	mobilenetv1_conv2d_12_pointwise_weights = variable<scalar>(shape = [1024,512,1,1], label = 'MobilenetV1/Conv2d_12_pointwise/weights');
	mobilenetv1_mobilenetv1_conv2d_12_pointwise_conv2d = conv(mobilenetv1_mobilenetv1_conv2d_12_depthwise_relu6, mobilenetv1_conv2d_12_pointwise_weights, 0.0, border = 'constant', padding = [], stride = [1,1], dilation = [1,1], groups = 1);
	mobilenetv1_conv2d_12_pointwise_batchnorm_gamma = variable<scalar>(shape = [1,1024], label = 'MobilenetV1/Conv2d_12_pointwise/BatchNorm/gamma');
	mobilenetv1_conv2d_12_pointwise_batchnorm_beta = variable<scalar>(shape = [1,1024], label = 'MobilenetV1/Conv2d_12_pointwise/BatchNorm/beta');
